cnf.esb.web/data/primeton.request.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:proj="http://www.primeton.com/ProjectInfoManService">
    <soapenv:Header/>
    <soapenv:Body>
        <proj:saveContractService>
            <proj:jsons>
                <cmpCode>111</cmpCode>
                <cmpName>111</cmpName>
                <contractCoods>111</contractCoods>
                <contractName>111</contractName>
                <contractCate>111</contractCate>
                <contractType>111</contractType>
                <parentCoods>111</parentCoods>
                <parta>111</parta>
                <partb>111</partb>
                <proTpye>111</proTpye>
                <proName>111</proName>
                <reqUnit>111</reqUnit>
                <reqOrg>111</reqOrg>
                <contractAmout>111</contractAmout>
                <taxRate>111</taxRate>
                <planSignDate>2009-06-15T13:45:30.0900000</planSignDate>
                <puMethod>111</puMethod>
                <puForm>111</puForm>
                <state>111</state>
                <factSignDate>2009-06-15T13:45:30.0900000</factSignDate>
                <conSignForm>111</conSignForm>
                <conTerm>111</conTerm>
                <conOdsadline>111</conOdsadline>
                <subtime>2009-06-15T13:45:30.0900000</subtime>
            </proj:jsons>
            <proj:jsons>
                <cmpCode>111</cmpCode>
                <cmpName>111</cmpName>
                <contractCoods>111</contractCoods>
                <contractName>111</contractName>
                <contractCate>111</contractCate>
                <contractType>111</contractType>
                <parentCoods>111</parentCoods>
                <parta>111</parta>
                <partb>111</partb>
                <proTpye>111</proTpye>
                <proName>111</proName>
                <reqUnit>111</reqUnit>
                <reqOrg>111</reqOrg>
                <contractAmout>111</contractAmout>
                <taxRate>111</taxRate>
                <planSignDate>2009-06-15T13:45:30.0900000</planSignDate>
                <puMethod>111</puMethod>
                <puForm>111</puForm>
                <state>111</state>
                <factSignDate>2009-06-15T13:45:30.0900000</factSignDate>
                <conSignForm>111</conSignForm>
                <conTerm>111</conTerm>
                <conOdsadline>111</conOdsadline>
                <subtime>2009-06-15T13:45:30.0900000</subtime>
            </proj:jsons>
        </proj:saveContractService>
    </soapenv:Body>
</soapenv:Envelope>